/**
 * Вывести на экран числа от 10 до 20 с помощью всех известных циклов.
 */

public class Homework4_1{
    public static void main(String[] args) {
        for (int i = 10; i < 21; i++) {
            System.out.println(i);
        }
    }
}
